# UpdateStyledObjects

## Description
Update all objects of the specified style.

```pascal
PROCEDURE UpdateStyledObjects(styleName : STRING);
```

```python
def vs.UpdateStyledObjects(styleName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|styleName|STRING|   |

## Version
Availability: from Vectorworks 2017

## Category
* Objects - Custom